In [1]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([1,-4, 5, 10, 11])

In [4]:
obj

0     1
1    -4
2     5
3    10
4    11
dtype: int64

In [5]:
obj.values

array([ 1, -4,  5, 10, 11], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
obj2 = pd.Series([1,-4, 5, 10, 11],index=['a','b','c','d','e'])

In [9]:
obj2

a     1
b    -4
c     5
d    10
e    11
dtype: int64

In [10]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
obj2['a']

1

In [12]:
obj2['d']=20

In [13]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [14]:
obj2[obj2>5]

d    20
e    11
dtype: int64

In [15]:
obj2*2

a     2
b    -8
c    10
d    40
e    22
dtype: int64

In [16]:
'f' in obj2

False

In [17]:
'a' in obj2

True

In [18]:
sddata = {'Ohio':3500,'Illinois':2000,'Texas':1000,'DC':5000}

In [19]:
obj3 = pd.Series(sddata)

In [20]:
obj3

Ohio        3500
Illinois    2000
Texas       1000
DC          5000
dtype: int64

In [21]:
obj3.index

Index(['Ohio', 'Illinois', 'Texas', 'DC'], dtype='object')

In [22]:
states = ['California','Ohio','Illinois','DC']
obj4 = pd.Series(sddata, index=states)

In [23]:
obj4

California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64

In [24]:
obj4.isna

<bound method Series.isna of California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64>

In [25]:
obj4.isnull

<bound method Series.isnull of California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64>

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Illinois      False
DC            False
dtype: bool

In [27]:
pd.isna(obj4)

California     True
Ohio          False
Illinois      False
DC            False
dtype: bool

In [28]:
obj3+obj4

California        NaN
DC            10000.0
Illinois       4000.0
Ohio           7000.0
Texas             NaN
dtype: float64

In [29]:
obj4.name = 'Crime Count'

In [30]:
obj4.index.name = 'State'

In [31]:
obj4

State
California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
Name: Crime Count, dtype: float64

In [32]:
obj4.index = ['DC','Ohio','Illinois','California']

In [33]:
obj4

DC               NaN
Ohio          3500.0
Illinois      2000.0
California    5000.0
Name: Crime Count, dtype: float64

In [34]:
data = {'State':['Illinois','Ohio','DC','Iowa','Indiana'],
         'Population':[100000,20000,10000,5000,20000],
       'Year':[2001,2005,2010,2008,2005]}

In [35]:
dobj = pd.DataFrame(data)

In [36]:
dobj

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [37]:
dobj.head()

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [38]:
dobj.tail()

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [39]:
dobj2 = pd.DataFrame(data, columns = ['Year','State','Population','Debt'],
                    index = ['One','Two','Three','Four','Five'])

In [40]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [41]:
dobj2

       Year     State  Population Debt
One    2001  Illinois      100000  NaN
Two    2005      Ohio       20000  NaN
Three  2010        DC       10000  NaN
Four   2008      Iowa        5000  NaN
Five   2005   Indiana       20000  NaN

In [42]:
obj2.Debt = 15.5

In [43]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [44]:
dobj2.Debt = 15.5

In [45]:
dobj2

       Year     State  Population  Debt
One    2001  Illinois      100000  15.5
Two    2005      Ohio       20000  15.5
Three  2010        DC       10000  15.5
Four   2008      Iowa        5000  15.5
Five   2005   Indiana       20000  15.5

In [46]:
dobj2.Debt = np.arrang(5)

NameError: name 'np' is not defined

In [49]:
dobj2.Debt = np.arange(5)

In [50]:
dobj2

       Year     State  Population  Debt
One    2001  Illinois      100000     0
Two    2005      Ohio       20000     1
Three  2010        DC       10000     2
Four   2008      Iowa        5000     3
Five   2005   Indiana       20000     4

In [52]:
dobj2.loc['One'].State = Ohio

NameError: name 'Ohio' is not defined

In [54]:
newstate = pd.Series(data = ['Ohio','Ohio','Iowa','Iowa','Iowa'],index = ['One','Two','Three','Four','Five'] )

In [55]:
dobj2.State = newstate

In [56]:
dobj2

       Year State  Population  Debt
One    2001  Ohio      100000     0
Two    2005  Ohio       20000     1
Three  2010  Iowa       10000     2
Four   2008  Iowa        5000     3
Five   2005  Iowa       20000     4

In [66]:
dobj2.Debt = np.random.randn(5)

In [68]:
dobj2

       Year State  Population      Debt
One    2001  Ohio      100000  0.979862
Two    2005  Ohio       20000  0.823669
Three  2010  Iowa       10000  0.459493
Four   2008  Iowa        5000 -1.272409
Five   2005  Iowa       20000 -0.099431

In [69]:
dobj2['Estern']=dobj2.State == 'Ohio'

In [72]:
dobj2[dobj2.State=='Iowa']

       Year State  Population      Debt  Estern
Three  2010  Iowa       10000  0.459493   False
Four   2008  Iowa        5000 -1.272409   False
Five   2005  Iowa       20000 -0.099431   False

In [75]:
dobj2[dobj2.Population >=10000 && dobj2.State == 'Ohio']

SyntaxError: invalid syntax (<ipython-input-75-4397540f93b1>, line 1)

In [65]:
help(np.random.randn)

Help on built-in function randn:

randn(...) method of mtrand.RandomState instance
    randn(d0, d1, ..., dn)

    Return a sample (or samples) from the "standard normal" distribution.

    If positive, int_like or int-convertible arguments are provided,
    `randn` generates an array of shape ``(d0, d1, ..., dn)``, filled
    with random floats sampled from a univariate "normal" (Gaussian)
    distribution of mean 0 and variance 1 (if any of the :math:`d_i` are
    floats, they are first converted to integers by truncation). A single
    float randomly sampled from the distribution is returned if no
    argument is provided.

    This is a convenience function.  If you want an interface that takes a
    tuple as the first argument, use `numpy.random.standard_normal` instead.

    Parameters
    ----------
    d0, d1, ..., dn : int, optional
        The dimensions of the returned array, should be all positive.
        If no argument is given a single Python float is returned.

    Returns
    -------
    Z : ndarray or float
        A ``(d0, d1, ..., dn)``-shaped array of floating-point samples from
        the standard normal distribution, or a single such float if
        no parameters were supplied.

    See Also
    --------
    standard_normal : Similar, but takes a tuple as its argument.

    Notes
    -----
    For random samples from :math:`N(\mu, \sigma^2)`, use:

    ``sigma * np.random.randn(...) + mu``

    Examples
    --------
    >>> np.random.randn()
    2.1923875335537315 #random

    Two-by-four array of samples from N(3, 6.25):

    >>> 2.5 * np.random.randn(2, 4) + 3
    array([[-4.49401501,  4.00950034, -1.81814867,  7.29718677],  #random
           [ 0.39924804,  4.68456316,  4.99394529,  4.84057254]]) #random

In [2]:
pop = {'Ohio':{2001: 4.5, 2002: 1.4, 2005:3.5},
        'Illinois':{2003:1.7, 2001:2.3, 2004:1.5}}

In [3]:
frame = pd.DataFrame(pop)

In [4]:
frame

      Ohio  Illinois
2001   4.5       2.3
2002   1.4       NaN
2003   NaN       1.7
2004   NaN       1.5
2005   3.5       NaN

In [5]:
frame.T

          2001  2002  2003  2004  2005
Ohio       4.5   1.4   NaN   NaN   3.5
Illinois   2.3   NaN   1.7   1.5   NaN

In [3]:
pdata = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'], columns=['Ohio', 'Texas', 'California'])

In [4]:
pdata

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [6]:
pdata2 = pdata.reindex(['a','b','c','d'])

In [7]:
pdata2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
states = ['Texas','NY','Texas']
pdata2.reindex(columns=states)

   Texas  NY  Texas
a    1.0 NaN    1.0
b    NaN NaN    NaN
c    4.0 NaN    4.0
d    7.0 NaN    7.0

In [12]:
pdata2.loc[['a','b','c','d'],states]

C:\Users\patelc\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  NY  Texas
a    1.0 NaN    1.0
b    NaN NaN    NaN
c    4.0 NaN    4.0
d    7.0 NaN    7.0

In [13]:
obj = pd.Series(np.arange(4.),index=['a','b','c','d'])

In [14]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [15]:
new_obj = obj.drop('c')

In [16]:
new_obj

a    0.0
b    1.0
d    3.0
dtype: float64

In [17]:
obj.drop(['a','b'])

c    2.0
d    3.0
dtype: float64

In [18]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [23]:
data = pd.DataFrame(np.arange(16.).reshape(4,4),index = ['one','two','three','four'],columns = ['a','b','c','d'])

In [24]:
data

          a     b     c     d
one     0.0   1.0   2.0   3.0
two     4.0   5.0   6.0   7.0
three   8.0   9.0  10.0  11.0
four   12.0  13.0  14.0  15.0

In [26]:
data.drop('two')

          a     b     c     d
one     0.0   1.0   2.0   3.0
three   8.0   9.0  10.0  11.0
four   12.0  13.0  14.0  15.0

In [29]:
data.drop('a',axis='columns')

          b     c     d
one     1.0   2.0   3.0
two     5.0   6.0   7.0
three   9.0  10.0  11.0
four   13.0  14.0  15.0

In [30]:
data

          a     b     c     d
one     0.0   1.0   2.0   3.0
two     4.0   5.0   6.0   7.0
three   8.0   9.0  10.0  11.0
four   12.0  13.0  14.0  15.0

In [32]:
data.drop('d',axis=1,inplace=True)

In [33]:
data

          a     b     c
one     0.0   1.0   2.0
two     4.0   5.0   6.0
three   8.0   9.0  10.0
four   12.0  13.0  14.0

In [34]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])

In [35]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [36]:
obj.shape

(4,)

In [37]:
obj.describe

<bound method NDFrame.describe of a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64>

In [38]:
obj[0]

0.0

In [39]:
obj[5]

IndexError: index out of bounds

In [40]:
obj[4]

IndexError: index out of bounds

In [41]:
obj[3]

3.0

In [42]:
obj['a']

0.0

In [43]:
obj['d':'a']

Series([], dtype: float64)

In [44]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [45]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [46]:
obj[1:3]=5

In [47]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [48]:
data = pd.DataFrame(np.arange(16.).reshape(4,4),index = ['one','two','three','four'],columns = ['a','b','c','d'])

In [49]:
data

          a     b     c     d
one     0.0   1.0   2.0   3.0
two     4.0   5.0   6.0   7.0
three   8.0   9.0  10.0  11.0
four   12.0  13.0  14.0  15.0

In [53]:
data[['a','b']]

          a     b
one     0.0   1.0
two     4.0   5.0
three   8.0   9.0
four   12.0  13.0

In [55]:
data[1:]

          a     b     c     d
two     4.0   5.0   6.0   7.0
three   8.0   9.0  10.0  11.0
four   12.0  13.0  14.0  15.0

In [56]:
data[1:3]

         a    b     c     d
two    4.0  5.0   6.0   7.0
three  8.0  9.0  10.0  11.0

In [57]:
data[data['d']>=9]

          a     b     c     d
three   8.0   9.0  10.0  11.0
four   12.0  13.0  14.0  15.0

In [58]:
data < 5

           a      b      c      d
one     True   True   True   True
two     True  False  False  False
three  False  False  False  False
four   False  False  False  False

In [59]:
data[data>10]=50

In [60]:
data

          a     b     c     d
one     0.0   1.0   2.0   3.0
two     4.0   5.0   6.0   7.0
three   8.0   9.0  10.0  50.0
four   50.0  50.0  50.0  50.0

In [72]:
import re
result = re.search(r'_I%d_','OPTN_DLR_PRICE_I3_AMT')
print(result)

None

In [2]:
obj3 = pd.Series(['Blue','Yellow','Purple'], index=[0,2,4])

In [3]:
obj3

0      Blue
2    Yellow
4    Purple
dtype: object

In [21]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index=['Utha','Illinois','Ohio','New York'], columns=['one','two','three','four'])

In [22]:
data

          one  two  three  four
Utha        0    1      2     3
Illinois    4    5      6     7
Ohio        8    9     10    11
New York   12   13     14    15

In [4]:
data['two']

Utha         1
Illinois     5
Ohio         9
New York    13
Name: two, dtype: int32

In [5]:
data > 5

            one    two  three   four
Utha      False  False  False  False
Illinois  False  False   True   True
Ohio       True   True   True   True
New York   True   True   True   True

In [6]:
data [data < 5] = 0

In [7]:
data

          one  two  three  four
Utha        0    0      0     0
Illinois    0    5      6     7
Ohio        8    9     10    11
New York   12   13     14    15

In [8]:
data.loc['Utha',['two','three']]

two      0
three    0
Name: Utha, dtype: int32

In [11]:
data.iloc[2,[2,3]]

three    10
four     11
Name: Ohio, dtype: int32

In [13]:
data.loc[:'Illinois',['two','three']]

          two  three
Utha        0      0
Illinois    5      6

In [16]:
data.iloc[:,:2]

          one  two
Utha        0    0
Illinois    0    5
Ohio        8    9
New York   12   13

In [19]:
data.iloc[:,:2][data.two > 5]

          one  two
Ohio        8    9
New York   12   13

In [23]:
data.reindex(columns=['one','two','three','four','five'])

          one  two  three  four  five
Utha        0    1      2     3   NaN
Illinois    4    5      6     7   NaN
Ohio        8    9     10    11   NaN
New York   12   13     14    15   NaN

In [26]:
data2 = data.reindex(columns=['one','two','three','four','five'],labels=['Utha','Illinois','New Jersy','New York'])

In [27]:
data2

            one   two  three  four  five
Utha        0.0   1.0    2.0   3.0   NaN
Illinois    4.0   5.0    6.0   7.0   NaN
New Jersy   NaN   NaN    NaN   NaN   NaN
New York   12.0  13.0   14.0  15.0   NaN

In [29]:
data2.drop('New Jersy')

           one   two  three  four  five
Utha       0.0   1.0    2.0   3.0   NaN
Illinois   4.0   5.0    6.0   7.0   NaN
New York  12.0  13.0   14.0  15.0   NaN

In [30]:
data2

            one   two  three  four  five
Utha        0.0   1.0    2.0   3.0   NaN
Illinois    4.0   5.0    6.0   7.0   NaN
New Jersy   NaN   NaN    NaN   NaN   NaN
New York   12.0  13.0   14.0  15.0   NaN

In [35]:
data2.drop('five', axis='columns',inplace=True)

KeyError: "['five'] not found in axis"

In [40]:
data2.drop('New Jersy',inplace=True)

KeyError: "['New Jersy'] not found in axis"

In [41]:
data2

           one   two  three  four
Utha       0.0   1.0    2.0   3.0
Illinois   4.0   5.0    6.0   7.0
New York  12.0  13.0   14.0  15.0

In [43]:
data2=data2

In [44]:
data2 =data

In [45]:
data

          one  two  three  four
Utha        0    1      2     3
Illinois    4    5      6     7
Ohio        8    9     10    11
New York   12   13     14    15

In [46]:
data2

          one  two  three  four
Utha        0    1      2     3
Illinois    4    5      6     7
Ohio        8    9     10    11
New York   12   13     14    15